In [ ]:
# US - Baby Names

### Introduction:

We are going to use a subset of [US Baby Names](https://www.kaggle.com/kaggle/us-baby-names) from Kaggle.  
In the file it will be names from 2004 until 2014


### Step 1. Import the necessary libraries

In [2]:
import pandas as pd
import numpy as np

### Step 2. Import the dataset from this [address](https://raw.githubusercontent.com/Laxminarayen/Inceptz-Batch13-Analytics_and_Python/master/08%20-%20Day%20-%208%20-%20Python%20Quiz%20Session/06_Stats/US_Baby_Names/US_Baby_Names_right.csv).

### Step 3. Assign it to a variable called baby_names.

In [3]:
baby_names = pd.read_csv('https://raw.githubusercontent.com/Laxminarayen/Inceptz-Batch13-Analytics_and_Python/master/08%20-%20Day%20-%208%20-%20Python%20Quiz%20Session/06_Stats/US_Baby_Names/US_Baby_Names_right.csv')

### Step 4. See the first 10 entries

In [4]:
baby_names.head(10)

   Unnamed: 0     Id      Name  Year Gender State  Count
0       11349  11350      Emma  2004      F    AK     62
1       11350  11351   Madison  2004      F    AK     48
2       11351  11352    Hannah  2004      F    AK     46
3       11352  11353     Grace  2004      F    AK     44
4       11353  11354     Emily  2004      F    AK     41
5       11354  11355   Abigail  2004      F    AK     37
6       11355  11356    Olivia  2004      F    AK     33
7       11356  11357  Isabella  2004      F    AK     30
8       11357  11358    Alyssa  2004      F    AK     29
9       11358  11359    Sophia  2004      F    AK     28

### Step 5. Delete the column 'Unnamed: 0' and 'Id'

In [5]:
baby_names.drop(['Unnamed: 0','Id'],axis=1,inplace=True)

### Step 6. Is there more male or female names in the dataset?

In [6]:
baby_names.groupby('Gender').count()

          Name    Year   State   Count
Gender
F       558846  558846  558846  558846
M       457549  457549  457549  457549

### Step 7. Group the dataset by name and assign to names

In [7]:
 baby_names.groupby('Name').count().sort_values(by='Count',ascending=False)

         Year  Gender  State  Count
Name
Riley    1112    1112   1112   1112
Avery    1080    1080   1080   1080
Jordan   1073    1073   1073   1073
Peyton   1064    1064   1064   1064
Hayden   1049    1049   1049   1049
...       ...     ...    ...    ...
Ethon       1       1      1      1
Malajah     1       1      1      1
Euan        1       1      1      1
Azyria      1       1      1      1
Nissen      1       1      1      1

[17632 rows x 4 columns]

### Step 8. How many different names exist in the dataset?

In [8]:
baby_names['Name'].drop_duplicates().count()

17632

### Step 9. What is the name with most occurrences?

In [9]:
baby_names['Name'].mode()

0    Riley
dtype: object

### Step 10. How many different names have the least occurrences?

In [10]:
baby_names.sort_values(by='Name',ascending=True).head()

         Name  Year Gender State  Count
693699  Aaban  2013      M    NY      6
695768  Aaban  2014      M    NY      6
897674  Aadan  2008      M    TX      5
120728  Aadan  2008      M    CA      7
138678  Aadan  2014      M    CA      5

### Step 11. What is the median name occurrence?

In [20]:
baby_names.sort_values(by='Count',ascending=True).median()

Year     2009.0
Count      11.0
dtype: float64

### Step 12. What is the standard deviation of names?

In [14]:
baby_names['Count'].std()

97.39734648625934

### Step 13. Get a summary with the mean, min, max, std and quartiles.

In [51]:
baby_names.describe().T

,count,mean,std,min,25%,50%,75%,max
Year,1016395.0,2009.053190,3.138293,2004.0,2006.0,2009.0,2012.0,2014.0
Count,1016395.0,34.850124,97.397346,5.0,7.0,11.0,26.0,4167.0